[
{"date": "2023-08-31", "title": "IT Business Consultant", "company": "Clariant", "location": "Airoli, Navi Mumbai, Maharashtra", "salary": null, "job_description": "Job ID:  37655 |  Location:  Airoli, Maharashtra, India \n    \n    \n   Responsible for translating business requirements into detailed function specifications of the respective Sub-Domain. Is responsible for the delivery of global IT business application services, including consulting, projects and maintenance. \n    \n     What will you be doing?  \n   \n   Development and implementation of Sub-Domain product  \n   1.Setting up (customising) the corresponding systems configuration and documentation  \n   2. Define project brief, initial cost assessment of projects, and the integration of other projects, and in potentially suppliers  \n   3. Analyse, evaluate and define system requirements and change requests  \n   4. Plan and monitor small and medium projects (incl. Resources) towards OTIF implementation of selected solution (On Time In Full) \n    \n    \n   Ensure effective support of Sub-Domain products  \n   1. Responsible for the implementation of service/product roadmap, ensuring alignment with business needs  \n   2. Responsible for specifying required service levels based on business criticality  \n   3. Responsible to ensure that service levels are met  \n   4. Responsible of deliver support/maintenance services according to agreed service levels and defined KPIs  \n   5. Plans and coordinates project resources  \n   6. Creation and development and/or implementation of user training/instruction  \n   7. Does Monitoring of and assures ticket handling in accordance with defined service level \n    \n    \n   Increase of efficiency  \n   1. Analyze the information requirements and information flows required to support better processes  \n   2. Identify process waste and improve within given application to ensure better data quality/connectivity \n    \n    \n   Leadership / People Management  \n   1. May lead a small team of IT Consultants in progressing the detail of the projects  \n   2. Effectively manage vendors to maintain support and deliver new features in a cost effective manner. \n    \n    \n   What do we expect?  \n   \n   Education:  \n   Higher education in a technical or business direction (e.g., computer science or MBA) at bachelor’s level or higher.  \n   At least 5 years of experience in the application environment and development tools relevant to the job \n    \n    \n   Business experience:  \n   More than 5 years of experience with relevant IT systems.  \n   Good consulting and project management skills, is familiar with an international, multi- cultural environment  \n   If needed: Specific SubDomain relevant knowledge \n    \n    \n   Additional Qualifications:  \n   Languages: Good written and spoken English is a must, other international languages desired  \n   International Cross-Culture experience  \n   Can deal with constantly changing problems, processes and technologies  \n   Works independently and proactively  \n   Communicative, initiates and maintains contacts with relevant business partners  \n   Analytical thinking, argues convincingly and fact-based \n    \n    \n   What´s in it for you?  \n   \n   \n    Be part of an amazing team, who will be there to support you.  \n    A forward-looking company, with a culture of innovation and a strong portfolio in sustainable technologies.  \n    Long term growth opportunity  \n    Employee Wellbeing & Assistance Program  \n    Work-Life Balance  \n    Hybrid Work Model  \n    On-site Recreation Center  \n    30 Days Annual Paid Leaves  \n    In-house Gym  \n    Subsidized Cafeteria Meals  \n    Centralized Company Transport For Designated Routes  \n    On-site Employee Health Center  \n    Group Medical Insurance  \n    Day Care facility (100% sponsored by Clariant)  \n    Inclusive Work Environment  \n    Ongoing Professional Development Opportunities  \n    Approachable Leadership  \n    Speak Up Culture \n   \n    \n    \n     \n   \n   Clariant is a focused, sustainable and innovative specialty chemical company based in Muttenz near Basel/Switzerland. On 31 December 2021, Clariant totaled a staff number of 11 537 and recorded sales of CHF 4.372 billion in the fiscal year for its continuing businesses. The company reports in three business areas: Care Chemicals, Catalysis and Natural Resources. Clariant’s corporate strategy is led by the overarching purpose of ‘Greater chemistry – between people and planet’ and reflects the importance of connecting customer focus, innovation, sustainability, and people. Join us and help create sustainable value through chemistry for customers all over the globe.", "url": "https://in.indeed.com/rc/clk?jk=b61fcb2f35f853f2&fccid=721030124be3382c&vjs=3"},
{"date": "2023-08-31", "title": "Information Technology (IT) Manager", "company": "thyssenkrupp nucera India Private Limited", "location": "Mumbai, Maharashtra", "salary": null, "job_description": "Company \n   thyssenkrupp nucera is the beginning of a new era defined by clean energy supply with green hydrogen at industrial scale. thyssenkrupp nucera offers world-leading technologies for high-efficiency electrolysis plants. The company, a Joint Venture with Industrie De Nora, has extensive in-depth knowledge in the engineering, procurement, construction and commissioning of electrochemical plants and a strong track record of more than 600 projects with a total rating of over 10 gigawatts already successfully installed. With its water electrolysis technology to produce green hydrogen, the company offers an innovative solution on an industrial scale for green value chains and an industry fueled by clean energy – a major step towards climate-neutrality.  \n   Your responsibilities  \n   As a IT Manager, you will be responsible for user support for thyssenkrupp nucera India. \n  \n    You are responsible for maintenance of infrastructure, applications, etc. to ensure secure IT operations \n    You will co-ordinate with external service providers, e.g., hardware and software \n    You are responsible for License management \n    You will co-ordinate global co-operation with head office in Germany as well as other international sites of thyssenkrupp nucera \n    You will be responsible for Procurement and supply of IT hardware and software for local requirements. \n    You will report security weaknesses and enforce all available IT security measures as specified by the head office. \n    The incumbent will be co-ordinating with Indian as well as German Management Team on various IT related topics. \n   \n   Your profile  \n  \n   Engineering Graduate in Computer, Information Technology or related fields \n    The candidate should have experience in plant design and plant building companies \n    6-8 years’ experience in maintaining IT Infrastructure including operating systems, security tools, applications, servers, email systems, laptops, desktops, software, and hardware, etc. \n    Fluency in English \n    Project Management skills \n    Can do attitude and problem solving skills \n   \n   Your benefits with us  \n  \n    Electrolysis - Green Hydrogen & Chlor Alkali Technology Provider for a livable planet. \n    Working on Global clients. \n    You will be part of new establishment for upcoming generation. \n    Company believes in Innovation and Employee Empowerment. \n    Excellent work culture \n   \n  Contact  \n   hrm.in@thyssenkrupp-nucera.com", "url": "https://in.indeed.com/rc/clk?jk=f76f8318f2084f5b&fccid=420b500a4ca0d81f&vjs=3"},
{"date": "2023-08-31", "title": "IT Procurement Buyer | 6 to 9 years | Mumbai", "company": "Capgemini", "location": null, "salary": null, "job_description": "Job Description \n   \n   \n    \n      Considerable knowledge of purchasing practices including best verses lowest price quote, closed bid process, total cost of purchase, cost savings of purchases.  \n     Good knowledge of competitive vendor base across all IT Hardware / Software categories across APAC \n      Market knowledge on IT Sourcing. \n      Process orientation person and aligning to the Procurement Process and policy. \n      Good understanding of PR to PO process and working experience in basic ERP for Supply Chain / Procurement. \n      Experience in managing RFP's , RFI , RFQ's and Reverse Auctions \n      Extensive experience in supplier relationship management and establishing supplier performance management framework \n      Knowledge on supplier due diligence & on boarding process and tools \n      Excellent skill in supplier negotiations and negotiation strategies \n      Hands on experience on source selection techniques and fair value requirements \n      Knowledge on local tax and regulations related to procurement. \n    \n   \n  \n  \n   \n     Primary Skill \n   \n   \n    \n      Minimum of 6-9 years' experience in sourcing, buying and supply chain management. Preferably dealing with Asia Countries. \n      Experience in managing supplier interactions and ideally some experience in reviewing contracts \n    \n   \n  \n  \n   \n     Secondary Skill \n   \n   \n    \n      Excellent interpersonal and communication skills and the ability to work effectively with colleagues, suppliers, and customers \n      Analytical skills in evaluating supplier terms, comparing prices, and benchmarking data \n      Ability to influence stakeholders and negotiate with suppliers \n      Ability to collaborate and work with global teams.", "url": "https://in.indeed.com/rc/clk?jk=ef75579580175b39&fccid=105ecfd0283f415f&vjs=3"},
{"date": "2023-08-31", "title": "IT Support (HTML)", "company": "Neural IT Pvt. Ltd.", "location": "Navi Mumbai, Maharashtra", "salary": "₹15,000 - ₹20,000 a month", "job_description": "Job Responsibilities: \n \n  Maintaining of websites. \n  Create, design, test and apply web-based applications. \n  Create the right code structures to resolve specific tasks. \n  Develop, program, test and debug all web based applications. \n  Prepare and coordinate intranet web updates and intranet website changes \n  Required Experience, Skills and Qualifications \n \n IT Skills: \n \n  Proficient using Advance Excel \n  HTML, CSS, Javas cript \n  Must be aware of codes \n  Project Co-ordination \n \n Soft Skills:- \n \n  Team player as well as ability to take up independent task. \n  Flexible \n \n Job Type: Full-time \n Benefits: \n \n  Health insurance \n  Provident Fund \n \n Schedule: \n \n  Day shift \n \n Experience: \n \n  IT support: 1 year (Preferred) \n \n Willingness to travel: \n \n  100% (Preferred) \n \n Ability to commute/relocate: \n \n  Navi Mumbai, Maharashtra: (Only Local candidates) \n \n Job Type: Full-time \n Salary: ₹15,000.00 - ₹20,000.00 per month \n Benefits: \n \n  Health insurance \n  Provident Fund \n \n Schedule: \n \n  Day shift \n  Monday to Friday \n \n Ability to commute/relocate: \n \n  Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Experience: \n \n  total work: 1 year (Preferred) \n \n Speak with the employer +91 98670 53931", "url": "https://in.indeed.com/company/Neural-IT/jobs/IT-Support-f9c39f206dd44e8b?fccid=8202ecee3d8ebe21&vjs=3"},
{"date": "2023-08-31", "title": "Network Engineer", "company": "ACL Digital", "location": "Navi Mumbai, Maharashtra", "salary": "Up to ₹3,50,000 a year", "job_description": "Payroll Company - ACL Digital \n Position –1) Network Engineer \n Client-Reliance \n Work Location : RCP, ghansoli, Mumbai \n Job Description: \n  Must have CCNA certified or Trained person. \n  Good in communication \n Outlook configuration, IP Configuration \n  Must have Network knowledge \n  Checking Network connectivity, Wi-Fi Connectivity. \n  Trouble shooting, Configure, tests, and maintains LAN/WAN equipment and related \n services. Identifies, diagnoses, and resolves network problem \n *Must be Graduate or 12+ Diploma \n Job Type: Full-time \n Salary: Up to ₹350,000.00 per year \n Schedule: \n \n  Rotational shift \n \n Ability to commute/relocate: \n \n  Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  total work: 1 year (Preferred) \n \n Work Location: In person", "url": "https://in.indeed.com/company/ACL-Digital/jobs/Network-Engineer-355f5777661d7135?fccid=224c86e9ad0c01e3&vjs=3"},
{"date": "2023-08-31", "title": "IT Compliance Manager", "company": "IDFC FIRST Bank", "location": "Navi Mumbai, Maharashtra", "salary": null, "job_description": "Role/Job Title:  IT Compliance Manager \n \n  \n Business:  Technology Management Group \n \n  \n Function/ Department:  Technology Management Group \n \n  \n Roles & Responsibilities: \n  'The role holder will lead the IT Compliance team, and will \n \n  \n  \n  Ensure execution of required testing and auditing activities for the IT team by internal and external parties leading to successful reports for the IT team on an ongoing basis  \n  Triage Change Management issues and provide recommendations  \n  Work collaboratively with ISG, Compliance and Internal Audit teams to identify and manage privacy, data protection risks, and compliance requirements to help meet stakeholder expectations  \n  Make recommendations on improving compliance related processes and/or procedures as it pertains to the IT team  \n  Partner with management, business teams, and data team to implement solutions  \n  Assist the Bank in the identification and management of IT security risks by assessing the current state  \n  Prioritize improvements and conduct compliance projects to reduce risk and improve regulatory compliance  \n  Create Compliance frameworks in issue templates and updating SOPs with relevant procedural information  \n  Triage and manage priorities of the IT Compliance team  \n  Represent the IT Compliance team in senior leadership forums  \n  Create and execute a plan to develop and mature our IT Compliance capabilities and Infrastructure  \n  \n Managerial & Leadership Responsibilities: \n  '- Provide technical guidance, coaching/mentoring to team members. \n \n  \n  \n  Provide input to performance management of team members.  \n  \n Key Success Metrics: \n  'Deliver & effectively track all the deliverables", "url": "https://in.indeed.com/rc/clk?jk=4379b19f2699cbd2&fccid=c1340f0b335b9dd7&vjs=3"},
{"date": "2023-08-31", "title": "IT Manager", "company": "CORO India", "location": "Chembur, Mumbai, Maharashtra", "salary": "₹30,000 - ₹40,000 a month", "job_description": "CORO India is seeking a skilled and dedicated IT Manager to join our organization. As the technical backbone of the organization, the IT Manager will play a crucial role in managing and optimizing our IT infrastructure.\n  \n  \n   \n     Location : Chembur, Mumbai, Maharashtra, India.  \n   \n   \n    Skills & Expertise:  \n    Proficient in Google Workspace Admin and Microsoft 365 Admin, with hands-on experience in using their administration tools and features.  \n    Skilled in managing Team Shared drives on Google Drive and OneDrive, facilitating efficient file sharing and collaboration.  \n    Capable of conducting comprehensive research to identify suitable technology solutions  based  on functionality, scalability, and cost-effectiveness  \n    Familiar with managing technology vendors, including selection, contract negotiation, and ongoing relationship management.  \n    Knowledgeable in data backup solutions, both online and offline.  \n    Proficient in updating IT policies and procedures to align with current technology standards and regulations.  \n    Providing general IT support to employees, addressing technical concerns, and assisting with software and hardware installations.  \n    Supporting and maintaining the organization’s IT infrastructure, including hardware, software, and network systems.  \n    Troubleshooting and resolving technical issues to ensure the smooth operation of computer systems and applications.  \n    Assisting in the implementation and maintenance of software applications such as HRMS systems.  \n    Qualifications:   \n    Bachelor’s degree in Computer Science, Information Technology, or a related field.  \n    2-4 years of experience in managing IT infrastructure and providing technical support.  \n    Strong knowledge and practical experience in managing IT infrastructure and providing technical support.  \n    Proficiency in administering Google Workspace and Microsoft Office 365.  \n    Detail-oriented with strong problem-solving and troubleshooting abilities.  \n    Good to have experience and skills:   \n    Background in data management streamlining, including the ability to analyze existing data processes, identify inefficiencies, and implement improvements to enhance data accuracy, accessibility, and security.  \n    Salary:   \n    The salary for this role will be  based  on the candidate’s experience and past salary, with a salary range of 30,000 to 40,000 INR. For exceptional candidates, the salary can go up to 50,000 INR.  \n    Send in your detailed resume to careers@coroindia.org with the Subject of the email “IT Manager”. Only shortlisted resumes will be contacted.", "url": "https://in.indeed.com/rc/clk?jk=9f353d23b43ae7a2&fccid=95adee1b52553897&vjs=3"},
{"date": "2023-08-31", "title": "IT Recruiter", "company": "Mobile Programming India Private Limited", "location": "Navi Mumbai, Maharashtra", "salary": "₹12,345 - ₹40,013 a month", "job_description": "Roles and Responsibilities: \n \n  Responsible for handling the end-to-end process of recruitment and other HR activities. \n  Develop and update job descriptions and specifications. \n  Interact with potential candidates using various Job Portals (Naukri, Monster and LinkedIn, etc.) \n \n and professional networks. \n \n  Screening candidate's resumes, contacting relevant candidates via calls and conduct on-site \n \n interviews. \n \n  Maintain candidate databases. \n  Contribute towards other HR engagement activities. \n  Monitor and apply best HR recruitment practices. \n  Assess and evaluate knowledge. communication skills, aptitude, and experience of the \n \n applicant. \n Qualifications: - \n \n  4 to 6 years of experience, Recruitment experience is mandatory. \n  Strong work ethic and sense of commitment. \n  Excellent communication skills required - oral and written. \n  Excellent PR skills with candidates, associates, and external recruitment agencies. \n  Constant growth and learning to ensure premium productivity for the organization. \n  Positive attitude and interpersonal skills. \n  End-to-end recruitment & Computer skills (Word, MS Excel, MS PowerPoint, Outlook, Internet etc.) \n \n Max CTC - 4 to 5.5 LPA \n Job Type: Full-time \n Salary: ₹12,345.11 - ₹40,012.78 per month \n Benefits: \n \n  Provident Fund \n \n Schedule: \n \n  Day shift \n \n Supplemental pay types: \n \n  Performance bonus \n \n Ability to commute/relocate: \n \n  Navi Mumbai, Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  IT Recruiting: 4 years (Required) \n  total work: 4 years (Required)", "url": "https://in.indeed.com/company/Mobile-Programming-India-Private-Limited/jobs/IT-Recruiter-0bf623e87f4b1c3e?fccid=92da476af4ea5a25&vjs=3"},
{"date": "2023-08-31", "title": "Business development executive-IT Hardware industry", "company": "Sky Services", "location": "Navi Mumbai, Maharashtra", "salary": "₹3,00,000 - ₹6,00,000 a year", "job_description": "Job Title:  Business development executive-IT Hardware industry. \n Location:  Navi-Mumbai. \n Functional Area:  IT- Hardware/Embedded/VLSI/Telecom. \n Industry:  IT-Hardware/Networking. \n Job Description: \n 1.Extensive experience in developing funnel and selling UC (including voice, video, conferencing) Solutions independently. 2.Understanding of major competitive offerings in the market including Avaya, NEC, Cisco, Unify, Alacatel-Lucent, Zoom, HP, Poly, Samsung, LG and many more etc. 3.Existing relationships with key decision makers within prospect organizations for communication solutions. 4.Capable of independently handling techno-commercial aspects when handling an opportunity. 5.Meeting and exceeding set sales quotas while adhering to company’s sales rules of engagement. 6.Manage close relationship with OEM account managers in the region of operation. 7.Communicate masterfully with customers on new products and service offerings. 8.Work with marketing to drive programs and events to extend the relationships to new prospects. 9.Continually learning about new products and improving selling skills. 10.Demonstrating and leveraging industry knowledge to improve business 11.Providing weekly reporting of pipeline and forecast. 12.Keeping abreast of competition, competitive issues and products. 13.Preparing written presentations, reports, and price quotations. 14.Conducting contract negotiations independently \n Job Type: Full-time \n Salary: ₹300,000.00 - ₹600,000.00 per year \n Benefits: \n \n  Health insurance \n \n Schedule: \n \n  Day shift \n \n Application Question(s): \n \n  How many years of experience as business development executive do you have in IT- Hardware/Embedded/VLSI/Telecom sector? \n  Do you belong to IT-Hardware/Networking industry? \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  Business development: 1 year (Preferred) \n  sales: 1 year (Preferred) \n \n Speak with the employer +91 9987916782", "url": "https://in.indeed.com/company/Sky-Services/jobs/Business-Development-Executive-7cf1be3f4b91b112?fccid=2043bd1eaf604942&vjs=3"},
{"date": "2023-08-31", "title": "Desktop Support Engineer L2", "company": "TECS INDIA PVT LTD", "location": "Navi Mumbai, Maharashtra", "salary": "Up to ₹3,50,000 a year", "job_description": "Job Description \n Proven experience as an IT Infrastructure Lead or a similar role, with at least 8 plus years of experience. \n Develop and execute strategies for the design, implementation, and maintenance of the organization's IT infrastructure, including hardware, software, networks, servers, and security systems.Remote support ,onsite calls escalation of calls \n Design & Implementation of IT Infrastructure Solutions (LAN, WAN, Lease Line, Wi-Fi, CCTV System etc) in Factory units. \n Stay up to date with industry trends and best practices in infrastructure management and remote mangement ,vendor mangement . \n Ensure the availability, performance, and security of the organization's IT infrastructure, including disaster recovery and business continuity planning. \n Strong problem-solving and decision-making abilities, with a focus on finding practical and efficient solutions. \n Excellent communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams. \n Job Type: Full-time \n Salary: Up to ₹350,000.00 per year \n Benefits: \n \n  Provident Fund \n \n Schedule: \n \n  Day shift \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  infra lead position: 10 years (Preferred)", "url": "https://in.indeed.com/company/TECS-INDIA-PVT-LTD/jobs/Desktop-Support-Technician-211823a9341f5f3b?fccid=4cd8eacaf76f8c2c&vjs=3"},
{"date": "2023-08-31", "title": "Faculty for Information technology", "company": "IBSAR Institute of Business Studies and Research", "location": "Navi Mumbai, Maharashtra", "salary": "₹1,50,000 - ₹3,00,000 a year", "job_description": "Qualification: MCA / MSc. in IT/CS / MBA in IT \n Experience: 2 years + Salary negotiable \n Job Types: Full-time, Permanent, Temporary Contract length: 12 months \n Salary: ₹150,000.00 - ₹300,000.00 per year \n Schedule: \n \n  Fixed shift \n \n Speak with the employer +91 7506436965", "url": "https://in.indeed.com/company/IBSAR-SCHOOL-OF-LAW/jobs/Information-Technology-Specialist-76d405e16ddc9c30?fccid=4f82e9f37beeaf4f&vjs=3"}
]