[
{"date": "2023-08-26", "title": "IT Recruiter", "company": "Chabez Tech", "location": "Navi Mumbai, Maharashtra", "salary": null, "job_description": "Job Description\n   Job title : IT Recruiter \n   Job Location : Belapur (Navi Mumbai) \n   Job Type : Full-time \n   Company Name : Chabeztech Pvt Ltd \n   About Us : \n   ChabezTech is a fast growing IT Staffing & Software development solution firm providing services in IT Services & Technology industry. ChabezTech is headquartered in Pennsylvania with office in India based in Mumbai and Pune with a client base all around the world. ChabezTech provide a wide variety of IT Staffing & Software development solution. We have an offshore hub for back end operations and support for clients all over the world. \n   Company Website : https://chabeztech.com/ \n   Role \n   Manage the entire life cycle of the recruitment process for clients in the Indian Market. \n   Summary \n   Work closely with the Recruiting leads and hiring managers. \n   Work on strategic global hiring programs. \n   Develop an action plan for recruiting the best fit for the organization. \n   Procure people for different IT Requirements. \n   Use niche platforms related to IT, to source potential candidates. \n   Personally conduct interviews, document the same, and report as the need arises. \n   In addition to executing individual responsibility should be able to work in unison with the other departments with the Company’s growth perspective in mind. \n   Keeping abreast of the industry trends. \n  \n   Requirements \n   Minimum experience of 1 year in IT Recruitment \n   Good verbal and Written Communication \n \n  \n  \n \n Additional Information\n   All your information will be kept confidential according to EEO guidelines.", "url": "https://in.indeed.com/rc/clk?jk=63d7203d4c4d39d2&fccid=18244d934292c56b&vjs=3"},
{"date": "2023-08-26", "title": "Network Engineer", "company": "OPTILINK NETWORKS", "location": "Chembur, Mumbai, Maharashtra", "salary": null, "job_description": "Job Summary: \n        \n       \n       \n         \n         \n         Job Summary  \n          \n          \n           Good Knowledge on Networking Layers & OSI layers. \n           \n          \n           Good knowledge on GPON Technology.- Fibre Optic \n           \n          \n           Working and Troubleshooting on routing protocols like EIGRP, LACP & Static route \n           \n          \n           Configuration of VLANs, RSTP, MSTP, IGMP, SNMP \n           \n          \n           Work in tandem with L2 / L3 to resolve escalated issues \n           \n          \n           Hands on experience on CISCO, Juniper switches \n           \n          \n           Online support to client \n           \n          \n           Visit to client \n           \n          \n           Ready to travel PAN India. \n          \n         \n        \n       \n        \n        \n       \n     \n     \n     \n      \n       \n        \n         Key Duties/Responsibilities: \n        \n       \n       \n       \n        \n          \n          \n          \n           \n            \n             Responsibilities \n             \n            \n             % of Time Spent \n            \n           \n            \n            \n            \n             Strategic:  \n              \n              \n               Demonstrate ability to understand and use of appropriate methods, tools and applications having rational and organised approach to work. \n               \n              \n               To provide 1st level support and taking ownership of Incident and Problem cases. \n               \n              \n            \n            \n             60 % \n            \n           \n            \n            \n            \n             Implementation:  \n              \n              \n               Visiting customer site and understanding customer requirement and configuring the devices. \n               \n              \n               Conduct POC on various CISCO and Juniper devices \n               \n              \n               Taking Secure meeting session to support customer in trouble shooting network issues \n               \n              \n            \n            \n             30% \n            \n           \n            \n            \n            \n             Managerial:  \n              \n              \n               Responsible for the uptime of the various client projects being managed / monitored. \n               \n              \n               Ensure that the tickets raised per shift are closed as per SLA and if not escalate as per the escalation Matrix defined. \n               \n              \n            \n            \n             10% \n            \n           \n          \n         \n        \n       \n      \n     \n      \n       \n     \n     \n      \n       \n        \n         \n          \n            \n           \n            \n             Attitudinal:  \n              \n              Good communication skills  \n              Energetic & self-motivated & team player.  \n              Goal achievers & positive thinking. \n             \n            \n             \n           \n            \n           \n            \n             Functional:  \n              \n              CCNA certified.  \n              Diploma in Hardware \n             \n              \n             \n           \n            \n           \n            \n             \n              Language Known: English, Hindi, Marathi \n             \n              \n             \n           \n            \n           \n            \n             \n              Travel Requirements: 70% from office and 30% from feid. \n             \n              \n             \n           \n            \n          \n         \n         Click on 'Apply Now' Button or you can send an email with your Resume to hr@optilinknetwork.com", "url": "https://in.indeed.com/rc/clk?jk=eb12459d45578676&fccid=24b4b7d403e4638b&vjs=3"},
{"date": "2023-08-26", "title": "IT Support-HTML", "company": "Neural IT Pvt. Ltd.", "location": "Navi Mumbai, Maharashtra", "salary": "₹18,000 - ₹20,000 a month", "job_description": "Maintaining of websites. Create, design, test and apply web-based applications. Create the right code structures to resolve specific tasks. Develop, program, test and debug all web based applications. Prepare and coordinate intranet web updates and intranet website changes Required Experience, Skills and Qualifications IT Skills: \n Proficient using Advance Excel \n HTML, CSS, Javas cript \n Must be aware of codes \n Project Co-ordination \n Soft Skills:- \n Team player as well as ability to take up independent task. Flexible \n Job Type: Full-time \n Salary: ₹13,000.00 - ₹25,000.00 per month \n Benefits: \n \n  Health insurance \n  Provident Fund \n \n Schedule: \n \n  Day shift \n \n Experience: \n \n  IT support: 1 year (Preferred) \n \n Willingness to travel: \n \n  100% (Preferred) \n \n Job Type: Full-time \n Salary: ₹18,000.00 - ₹20,000.00 per month \n Benefits: \n \n  Health insurance \n \n Schedule: \n \n  Day shift \n  Monday to Friday \n \n Ability to commute/relocate: \n \n  Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Experience: \n \n  HTML: 1 year (Required) \n \n Speak with the employer +91 9867053931", "url": "https://in.indeed.com/company/Neural-IT/jobs/IT-Support-18021d6a39649bca?fccid=8202ecee3d8ebe21&vjs=3"},
{"date": "2023-08-26", "title": "IT Recruiter", "company": "ChabezTech Private Limited", "location": "Navi Mumbai, Maharashtra", "salary": "₹12,348 - ₹39,968 a month", "job_description": "Job title : IT Recruiter \n Job Location : Belapur (Navi Mumbai) \n Job Type : Full-time \n Company Name : Chabeztech Pvt Ltd \n About Us : \n ChabezTech is a fast growing IT Staffing & Software development solution firm providing services in IT Services & Technology industry. ChabezTech is headquartered in Pennsylvania with office in India based in Mumbai and Pune with a client base all around the world. ChabezTech provide a wide variety of IT Staffing & Software development solution. We have an offshore hub for back end operations and support for clients all over the world. \n Company Website : https://chabeztech.com/ \n Role \n Manage the entire life cycle of the recruitment process for clients in the Indian Market. \n Summary \n Work closely with the Recruiting leads and hiring managers. \n Work on strategic global hiring programs. \n Develop an action plan for recruiting the best fit for the organization. \n Procure people for different IT Requirements. \n Use niche platforms related to IT, to source potential candidates. \n Personally conduct interviews, document the same, and report as the need arises. \n In addition to executing individual responsibility should be able to work in unison with the other departments with the Company’s growth perspective in mind. \n Keeping abreast of the industry trends. \n Requirements \n Minimum experience of 1 year in IT Recruitment \n Good verbal and Written Communication \n Job Type: Full-time \n Salary: ₹12,348.49 - ₹39,967.88 per month \n Ability to commute/relocate: \n \n  Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  Recruiting: 1 year (Preferred) \n  total work: 1 year (Preferred) \n \n Speak with the employer +91 90223 14142", "url": "https://in.indeed.com/company/ChabezTech-Private-Limited/jobs/IT-Recruiter-b07f3cbb275aab79?fccid=51ff1e676ea9dd1b&vjs=3"},
{"date": "2023-08-26", "title": "Embedded Developer & Tech Support", "company": "Dream vertex", "location": "Panvel, Maharashtra", "salary": "From ₹6,000 a month", "job_description": "Job Vacancy: Embedded Developer & Tech Support \n About Us: DreamVertex is a pioneering technology company dedicated to creating cutting-edge electronic solutions for various industries. Our commitment to innovation and excellence drives us to deliver top-notch products and services to our clients. We are currently seeking a versatile and motivated individual to join our team as an Embedded Developer & Tech Support professional. \n Role Overview: As an Embedded Developer & Tech Support atDreamVertex, you will play a pivotal role in both the development of electronic projects and providing exceptional technical support to our clients. This hybrid role offers a unique opportunity to contribute to project design, development, and testing, while also engaging directly with clients to provide technical assistance and presentations. \n Key Responsibilities: \n \n  Collaborate with the development team to assist in the design and development of electronic projects, including embedded systems and devices. \n  Participate in the testing and validation of electronic components and systems to ensure functionality and quality. \n  Provide comprehensive tech support to clients, addressing their inquiries and troubleshooting any issues that arise. \n  Deliver engaging presentations to clients, showcasing the features, benefits, and technical aspects of our products and solutions. \n  Prepare and organize presentation materials, technical documentation, and other resources for client meetings. \n \n Qualifications: \n \n  diploma in Electronics Engineering, electronics & communication, person willing to work in electronic domain should only applu. \n  basic knowledge in embedded systems development and programming languages such as C/C++. \n  Basic understanding of electronic components, microcontrollers, and hardware-software interaction. \n  Excellent problem-solving skills and the ability to diagnose and resolve technical issues effectively. \n  Exceptional communication skills, both written and verbal, for client interactions and presentations. \n \n Job Types: Full-time, Fresher \n Salary: From ₹6,000.00 per month \n Schedule: \n \n  Day shift \n \n Ability to commute/relocate: \n \n  Panvel, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Diploma (Preferred) \n \n Experience: \n \n  Technical support: 1 year (Preferred) \n  total work: 1 year (Preferred) \n \n Speak with the employer +91 9930703546", "url": "https://in.indeed.com/company/Dream-vertex/jobs/Technical-Support-Specialist-f2961c1ed2ffe7a5?fccid=e879742b6d27b6b5&vjs=3"},
{"date": "2023-08-26", "title": "IT Automation Testing", "company": "Hirerise Talent search", "location": "Navi Mumbai, Maharashtra", "salary": "₹2,00,000 - ₹3,00,000 a year", "job_description": "About GRT Global Logistics: \n GRT Global Logistics Pvt. Ltd. – Leading International Freight Forwarder, Consolidator and Logistics company (grtship.com) \n GRT Global Logistics is one of the leading international freight forwarder and logistics service provider based in Mumbai. GRT is a systems centric and process driven company focused on creating value for its employees, investors, customers and other stake holders. GRT is in advanced stages of developing a world class ERP solution to manage sales, operations, CRM, accounts, finance and other functions for the logistics and freight forwarding industry. \n Job Description: \n We are seeking a diligent and detail-oriented Software Tester to join our dynamic team. As a Software Tester, you will play a crucial role in ensuring the quality and reliability of our software products through comprehensive testing and analysis. Your responsibilities will include developing test plans, executing test cases, identifying and documenting defects, and collaborating with the development team to ensure timely issue resolution. Your expertise and commitment to quality will contribute to the successful delivery of high-performance software solutions to our clients. \n Responsibilities: \n ● Develop test plans, test scenarios, and test cases based on project requirements and design specifications. \n ● Execute automated tests to verify software functionality, performance, usability, and security. \n ● Identify, document, and prioritize software defects, bugs, and issues using a defect tracking system. \n ● Collaborate with the development team to understand software requirements, design intent, and technical specifications. \n ● Conduct thorough regression testing to ensure that software modifications and enhancements do not adversely affect existing functionality. \n ● Perform compatibility testing across different platforms, operating systems, and browsers. \n ● Participate in design and requirement review meetings to provide input on testability and quality aspects. \n ● Analyze and troubleshoot software issues, investigating and communicating their root causes to the development team. \n ● Work closely with cross-functional teams, including developers, business analysts, and project managers, to ensure effective communication and collaboration throughout the testing process. \n ● Continuously enhance testing processes and methodologies to improve efficiency, accuracy, and effectiveness. \n ● Stay updated with industry trends, emerging technologies, and best practices in software testing. \n Requirements: \n ● Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience). \n ● Proven experience as a Software Tester or in a similar role. \n ● Strong understanding of software development life cycle (SDLC) and software testing principles. \n ● Strong programming skills: Proficiency in one or more programming languages such as Java, Python, C#, or JavaScript is essential for writing and maintaining test automation scripts. \n ● Experience with automation testing tools: Familiarity with popular automation testing frameworks and tools such as Selenium WebDriver, Appium, Cucumber, JUnit, TestNG, or similar tools is necessary. \n ● Knowledge of test automation frameworks: Understanding and experience with test automation frameworks, such as Keyword-driven, Data-driven, or Behavior-driven development (BDD), can be advantageous. \n ● Scripting and automation experience: Ability to write and execute automation scripts for web applications, APIs, or mobile applications using appropriate tools and frameworks. \n ● Test data management: Ability to create and maintain test data sets and databases for automated testing. \n ● Performance testing: Familiarity with performance testing tools like JMeter or LoadRunner to conduct load, stress, and performance testing is a plus. \n ● Agile methodologies: Experience working in an Agile development environment and understanding of Agile principles and practices. \n ● API testing: Knowledge of API testing tools such as Postman, SoapUI, or REST Assured, and experience in testing web services, RESTful APIs, or microservices. \n ● Test automation best practices: Understanding of best practices for test automation, including test script design, maintainability, scalability, and test data management. \n ● Troubleshooting and debugging skills: Proficiency in identifying and resolving issues with test automation scripts and environments. \n ● Strong problem-solving skills: Ability to analyze complex scenarios and troubleshoot issues encountered during test automation. \n ● Self-motivated and proactive: Willingness to learn new tools, technologies, and frameworks independently and stay updated with industry trends in test automation. \n Office Location: Saki Naka, Andheri (E) \n Job Type: Full-time \n Salary: ₹200,000.00 - ₹300,000.00 per year \n Schedule: \n \n  Day shift \n \n Ability to commute/relocate: \n \n  Sakinaka, Andheri East, Navi Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Bachelor's (Required) \n \n Speak with the employer +91 8850336448", "url": "https://in.indeed.com/company/Hirerise-Talent-search/jobs/Software-Test-Engineer-49940fa8ba5f5cf4?fccid=2a28aad534120966&vjs=3"},
{"date": "2023-08-26", "title": "Hiring for IT Executive- Mahape (Sat/Sun Off)", "company": "3 Business", "location": "Navi Mumbai, Maharashtra", "salary": "₹13,000 - ₹20,000 a month", "job_description": "Exp - Firewall, Right's Management,Protection of data,Antivirus Installation,Managing windows server,Managing IP security,resolving IT issues. \n Position -   IT Executive \n Location -  Mahape Salary-  13k-20k Work Time -  09am - 07pm \n WO - Sat off and Sunday off \n Exp -min 1year of exp in IT \n Edu-    Diploma in Computer/BCA/MCA/Btech/Mtech \n *****Experience Candidates only can apply. Only male candidates can apply.Fresher donot apply. ***** \n Whatsapp me  to know  address, date and time  for interview on  9769464986 . \n Or E-mail on hr@threebiz.co.uk.  \n No charges apply to come down for Interview. \n Job Types: Full-time, Permanent, Fresher \n Salary: ₹13,000.00 - ₹20,000.00 per month \n Application Question(s): \n \n  Where in mumbai do you stay? \n  If selected can you join immediately? \n  Do you have exp on firewall? \n  Do you have work experience on Data Protection, IT Security, Implementation and Installation of anti virus? \n \n Education: \n \n  Diploma (Required) \n \n Experience: \n \n  Computer Hardware and Networking: 1 year (Preferred) \n \n Work Location: In person", "url": "https://in.indeed.com/company/3-BUSINESS/jobs/IT-Executive-1ae713c25564ec5c?fccid=29e5f0ace84565ce&vjs=3"},
{"date": "2023-08-26", "title": "Desktop Support Engineer L2", "company": "Kloud Consulting Services", "location": "Navi Mumbai, Maharashtra", "salary": "₹18,000 - ₹22,000 a month", "job_description": "Troubleshooting & fixing desktop / laptop OS, email client, printer / scanner related issues \n  Problem solving Capability in various brand laptop / desktop / Printer Hardware \n \n \n  Escalation handling \n  Desktop /Laptop Inventory management / Asset Management \n  Leading the FMS Team in absence of Team Leader \n \n \n  Ability to quickly analyze & diagnose technical problems \n  Independently generates solutions based on analytical, technical skills and business \n  Problem determination and resolution within SLA’s \n \n \n  Should be able to Perform Root Cause Analysis for the incidents Handle technical escalations \n  Ability to acquire; new skills & keep them updated \n  Proactive and clear communication skills \n \n \n  Quality and Process Knowledge \n  Should be good in client communication skills \n  Experience in the IT support desk tools will be added advantage \n \n Job Types: Full-time, Permanent, Temporary Contract length: 12 months \n Salary: ₹18,000.00 - ₹22,000.00 per month \n Schedule: \n \n  Day shift \n \n Supplemental pay types: \n \n  Performance bonus \n \n Experience: \n \n  Desktop support: 2 years (Required) \n \n Work Location: In person", "url": "https://in.indeed.com/company/Kloud-Consulting-Services/jobs/Desktop-Support-Technician-5e71028bcd7a3178?fccid=e998eaff0c5042e0&vjs=3"},
{"date": "2023-08-26", "title": "Sr. Network Engineer", "company": "Textronics Design Systems (I) Pvt. Ltd.", "location": "Navi Mumbai, Maharashtra", "salary": "₹15,000 - ₹20,000 a month", "job_description": "Need Experience of 1 to 2 years \n  Manage IT,Comp system & UPS \n  Ensure and monitor data security, network access and back up systems \n  Hardware Network Troubleshooting \n  Conduct Regular System Audit \n  Manage E-mail, Spam & Virus Protection- Manage organization’s Helpdesk ( internal, external or both) \n  Configuration of Firewalls \n  Client, Stakeholder etc management \n  Veeam backup & replication \n  Install, Configure, manage SYNOLOGY storage \n  Help define project scope, goals and deliverables \n  Monitor and report progress \n  Internal & External Support ( Server Status ) \n  Hardware and Software Management \n \n Job Types: Full-time, Permanent \n Salary: ₹15,000.00 - ₹20,000.00 per month \n Benefits: \n \n  Provident Fund \n \n Schedule: \n \n  Day shift \n \n Ability to commute/relocate: \n \n  Navi Mumbai - 400710 , Maharashtra: Reliably commute or planning to relocate before starting work (Required) \n \n Education: \n \n  Bachelor's (Preferred) \n \n Experience: \n \n  0,6 months: 1 year (Preferred) \n \n Speak with the employer +91 7710849355", "url": "https://in.indeed.com/company/Textronics-Design-Systems-(I)-Pvt.-Ltd./jobs/Senior-Network-Engineer-cfe2225ed836f7db?fccid=e57d10152cea5830&vjs=3"}
]

